//#include<iostream> /* Подключение библиотеки функции  ввода/вывода(iostream) и Windows API(Windows.h)*/
//#include<Windows.h> 
//using namespace std;/*Объявление пространства имен std*/
//void sorter(char marr[]) { /*Объявление и описание функции sorter, которая принимает массив
//						   элементов символьного типа в виде аргумента и сортирует их по алфавиту*/
//	int i = 0;
//	do {
//		cout << marr[i] << " "; /*Вывод исходного массива на экран*/
//		i++;
//	} while (i < 13);
//	cout << endl;
//	i = 0;
//	int j = 0;
//	int temp = 0;
//	for (int i = 0; i < 13; i++) {
//		for (int j = 0; j < 13 - i; j++) { /*Сортировка элементов с использованием метода "пузырьковой сортировки*/
//			if (marr[j] > marr[j + 1]) {
//				temp = marr[j];
//				marr[j] = marr[j + 1];
//				marr[j + 1] = temp;
//			}
//		}
//	}
//	i = 0;
//	do {
//		cout << marr[i] << " "; /*Вывод отсортированного массива на экран*/
//		i++;
//	} while (i < 15);
//}
//int main(int argc, const char *argv[]) { /*Описание функции main*/
//	static char arr[] = { 'K','S','C','M','R','O','N','Q','P','Z','G','C','H' }; /*Исходный массив, объявленный в теле 
//																				 функции main*/
//	sorter(arr); /*Инициация функции sorter(some_array)*/
//	system("pause");/*Приостановление выполнение программы, позволяющее ознакомиться с результатами выполнения программы*/
//}
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/




/*ADDITIONAL TASK 1 DONE*/




//#include<iostream>
//#include<Windows.h>
//#include<cstdio>
//#include <stdio.h>
//using namespace std;
//void lastOne( char element) {
//	if (element == 'я') {
//				element = 'а';
//				cout << element << " ";
//			}
//			else if (element == 'Я') {
//				element = 'А';
//				cout << element << " ";
//			}
//			else if (element == 'z') {
//				element = 'a';
//				cout << element << " ";
//			}
//			else if (element == 'Z') {
//				element = 'A';
//				cout << element << " ";
//			}
//}
//void Caesar(char element) {
//	int i = 0;
//	char lilLatinSymbols[] = { 'a', 'b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z' };
//	char bigLatinSymbols[] = { 'A', 'B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z' };
//	char lilCyrrilicSymbols[] = {'а','б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я' };
//	char bigCyrrilicSymbols[] = { 'А','Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я' };
//	for (int i = 0; i < 35; i++)
//	{
//		if (element == lilLatinSymbols[i]) {
//			element == lilLatinSymbols[i + 1];
//			if (element == 'я' || element == 'Я' || element == 'Z' || element == 'z'  )
//			{
//				lastOne(element);
//			} if (element != 'я' && element != 'Я' && element != 'Z' && element != 'z') {
//
//				cout << lilLatinSymbols[i + 1] << " ";
//			}
//			
//		}
//		else if (element == bigLatinSymbols[i]) {
//			element == bigLatinSymbols[i + 1];
//			if (element == 'я' || element == 'Я' || element == 'Z' || element == 'z')
//			{
//				lastOne(element);
//			} if (element != 'я' && element != 'Я' && element != 'Z' && element != 'z') {
//
//				cout << bigLatinSymbols[i + 1] << " ";
//			}
//		}
//		else if (element == lilCyrrilicSymbols[i]) {
//			element == lilCyrrilicSymbols[i + 1];
//			if (element == 'я' || element == 'Я' || element == 'Z' || element == 'z')
//			{
//				lastOne(element);
//			} if (element != 'я' && element != 'Я' && element != 'Z' && element != 'z') {
//
//				cout << lilCyrrilicSymbols[i + 1] << " ";
//			}
//		}
//		else if (element == bigCyrrilicSymbols[i]) {
//			element == bigCyrrilicSymbols[i + 1];
//			if (element == 'я' || element == 'Я' || element == 'Z' || element == 'z')
//			{
//				lastOne(element);
//			} if (element != 'я' && element != 'Я' && element != 'Z' && element != 'z') {
//
//				cout << bigCyrrilicSymbols[i + 1] << " ";
//			}
//		}
//	}
//	}
//
//
//int main() {
//	SetConsoleCP(1251); 
//	SetConsoleOutputCP(1251);
//	setlocale(LC_ALL, "Russian");
//	cout << "Здесь мы будем применять алгоритм кода Цезаря для смещения букв.";
//	cout << "Введите интересующие вас символы и нажмите Enter по окончанию:";
//
//	char *yourAlphabet = new char[NULL];
//	int i = 0;
//	cin >> yourAlphabet;
//	int  size =strlen(yourAlphabet);
//	for (int  i = 0; i < size; i++)
//	{
//		cout << yourAlphabet[i] << " ";
//	}
//	cout << "\nА теперь применим алгоритм кода Цезаря:" << endl;
//	for (int i = 0; i <= size; i++)
//	{
//		Caesar(yourAlphabet[i]);
//	}
//	system("pause");
//}


///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/


/*ADDITIONAL TASK 2 NEED TO BE REWORKED*/

//#include<iostream>
//#include<Windows.h>	
//#include<string>
//#include<cstdlib>
//#include<clocale>
//using namespace std;
//int main() {
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	setlocale(LC_ALL, "Russian");
//	cout << "Вводи символы, братуха!";
//	cout << "Необходимо перед каждым знаком '=' вставить символ, стоящий за ним\n";
//		string yourInput;
//		int i = 0;
//		getline(cin, yourInput);
//		
//		int  size = yourInput.length();
//		for (int i = 0; i < size; i++)
//		{
//			cout << yourInput[i] << " ";
//		}
//		for (int i = 0; i < size; i++)
//		{
//			if (yourInput[i] == '=') {
//				yourInput[i] = yourInput[i + 1] + 'get';
//			}
//		}
//		for (int i = 0; i < size; i++)
//		{
//			cout << yourInput[i] << " ";
//		}
//		system("pause");
//}






///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/




/*ADDITIONAL TASK 3 NEED TO BE REWORKED */

//#include<iostream>
//#include<vector>
//#include<Windows.h>
//#include<string>
//using namespace std;
//
//int main() {
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	setlocale(LC_ALL, "Russian");
//	cout << "Type some symbols\n";
//	string yourInput;
//	int i = 0;
//	getline(cin, yourInput);
//	int  size = yourInput.length();
//	for (int i = 0; i < size; i++)
//	{
//		cout << yourInput[i] << " "; //Удалить потом это бесполезное говнище
//	}
//	int counter=0;
//	for (int i = 0; i < size; i++)
//				{
//					if (yourInput[i] == '1'|| yourInput[i] == '2' || yourInput[i] == '3' || yourInput[i] == '4' || yourInput[i] == '5' || yourInput[i] == '6' || yourInput[i] == '7' || yourInput[i] == '8' || yourInput[i] == '9'|| yourInput[i] == '0'  ) {
//						yourInput.erase(yourInput.end()-2);
//						cout << yourInput << endl;
//					}
//				}
//				
//				system("pause");
//}

///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/




//ADDITIONAL TASK 4 DONE 


//#include<iostream>
//#include<Windows.h>	
//#include<string>
//#include<cstdlib>
//#include<clocale>
//using namespace std;
//int main() {
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	setlocale(LC_ALL, "Russian");
//	cout << "Данная программа устраивает вакханалию со скобками\n";
//	cout << "Желательно, чтобы их было побольше. Go ahead, bruh!\n";
//	string yourInput;
//	int i = 0;
//	getline(cin, yourInput);
//	int  size = yourInput.length();
//	int spacecounter = 0;
//	cout << "Вывод массива:\n";
//	for (int i = 0; i < size; i++)
//	{
//		if (yourInput[i] == ' ') {
//			spacecounter++;
//			if (spacecounter == 4) {
//				yourInput[i + 1] = '.';
//				cout << yourInput[i + 1];
//				yourInput.erase(i + 2, size-(i+1));
//				system("pause");
//			}
//			
//		}
//		cout << yourInput[i] << " ";
//		
//	}
//
//	system("pause");
//}























///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/
///*______________________________________________________________________________________________________________________________________*/


/*ADDITIONAL TASK 5 DONE*/

//#include<iostream>
//#include<Windows.h>	
//#include<string>
//#include<cstdlib>
//#include<clocale>
//using namespace std;
//int main() {
//		SetConsoleCP(1251);
//		SetConsoleOutputCP(1251);
//		setlocale(LC_ALL, "Russian");
//		cout << "Данная программа устраивает вакханалию со скобками\n";
//		cout << "Желательно, чтобы их было побольше. Go ahead, bruh!\n";
//		string yourInput;
//			int i = 0;
//			getline(cin, yourInput);
//			int  size = yourInput.length();
//			cout << "Вывод массива:\n";
//			for (int i = 0; i < size; i++)
//			{
//				cout << yourInput[i] << " ";
//			}
//			cout << "\nЗамена скобок:\n";
//			int skobka1 = 0, skobka2=0;
//			for (int i = 0; i < size; i++)
//			{
//				if (yourInput[i] == '(') {
//					skobka1++;
//				}
//				else if (yourInput[i] == ')') {
//					skobka2++;
//				}
//			}
//			for (int i = 0; i < size; i++)
//			{
//				cout << yourInput[i] << " ";
//			}
//			cout << "\n";
//			cout << skobka1 << " левых скобочек" << endl;
//			cout << skobka2 << " правых скобочек" << endl;
//			skobka2 = 0;
//			for (int i = 0; i < size; i++)
//			{
//				if (yourInput[i] == ')') {
//					skobka2++;
//					if (skobka2 > skobka1) {
//						yourInput[i] = '?';
//					}
//				}
//			}
//			cout << "Ребята, у меня к вас V O P R O S I K I\n";
//			for (int i = 0; i < size; i++)
//			{
//				cout << yourInput[i] << " ";
//			}
//			system("pause");
//}